'use strict';

/**
 * おまけ : ロゴ的な感じでfigletを表示しておこう……
 */
console.log(`\
                    __           _____                      __               ___             ___              _
  _______ ____  ___/ /__  __ _  / ___/__ ___  ___ _______ _/ /____  ____    / _/__  ____    / _/__  __ ______(_)__ ____
 / __/ _ \`/ _ \\/ _  / _ \\/  ' \\/ (_ / - _) _ \\/ -_) __/ _ \`/ __/ _ \\/ __/  / _/ _ \\/ __/   / _/ _ \\/ // / __/ / -_) __/
/_/  \\_,_/_//_/\\_,_/\\___/_/_/_/\\___/\\__/_//_/\\__/_/  \\_,_/\\__/\\___/_/     /_/ \\___/_/     /_/ \\___/\\_,_/_/ /_/\\__/_/   
`);

/**
 * 定数の定義 : 幅・高さ
 */
/** @type {Number} - 板の幅。単位はmm*/
const W = 600;
/** @type {Number} - 板の高さ。単位はmm */
const H = 900;

/**
 * XY平面上に点を2つとる。
 * 周り3mmを取り除いて、1mm単位でとる
 */
const x = Math.floor(Math.random() * (W - 6)) + 3;
const y = Math.floor(Math.random() * (H - 6)) + 3;
const X = Math.floor(Math.random() * (W - 6)) + 3;
const Y = Math.floor(Math.random() * (H - 6)) + 3;

/**
 * 2点間の距離を求める
 */
const d = Math.sqrt((x - X) ** 2 + (y - Y) ** 2);

/**
 * 距離の1.1倍〜2倍の間で、ランダムな値を"紐の長さ"として生成する(1mm単位)
 */
const r = Math.floor(Math.random() * (d * 0.9) + d * 1.1);

/**
 * 結果をまとめて表示する
 */
console.log(`\
板のサイズ: ${W}mm x ${H}mm

点1: (${("" + x).padStart(3, " ")}mm, ${("" + y).padStart(3, " ")}mm)
点2: (${("" + X).padStart(3, " ")}mm, ${("" + Y).padStart(3, " ")}mm)

2点間の距離: ${d.toFixed(2)}mm
紐の長さ: ${r}mm
(倍率 : 約${(r / d).toFixed(2)}倍)
`);
